ciniml/stackchan-idf/sdkconfig.defaults.esp32s3
# M5Stack CoreS3 (ESP32-S3) specific defaults.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# CoreS3 has 8 MB quad-SPI PSRAM. The avatar canvas (320*240*2 = 150 KB) lives there.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Default console on the on-board USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
